backend/artillery/tests/BrowseQuestionTabsFlow.yml
config:
    target: "http://localhost:5001/api"
    phases:
        - duration: 60
          arrivalRate: 5
          name: Warm up
        - duration: 120
          arrivalRate: 2
          rampTo: 30
          name: Ramp up load
        - duration: 500
          arrivalRate: 30
          name: Sustained load
    defaults:
        headers:
            utorid: "dummy22"
    payload:
        - path: "../questions.txt"
          fields:
              - "qnsLink"
          loadAll: true
        - path: "../courses.txt"
          fields:
              - "courseId"
          loadAll: true

scenarios:
    - name: "Browse all question tabs"
      flow:
          - get:
                url: "/question/oneQuestion/{{ qnsLink }}"
          - get:
                url: "/discussion/thread/{{ qnsLink }}"
          - get:
                url: "/question/editHistory/{{ qnsLink }}"