backend/artillery/tests/VisitOwnProfileFlow.yml
config:
    target: "http://localhost:5001/api"
    phases:
        - duration: 60
          arrivalRate: 5
          name: Warm up
        - duration: 120
          arrivalRate: 2
          rampTo: 25
          name: Ramp up load
        - duration: 500
          arrivalRate: 25
          name: Sustained load
    defaults:
        headers:
            utorid: "dummy22"

scenarios:
    - name: "Visit own profile"
      flow:
          - get:
                url: "/badge/userBadges/dummy22"
          - get:
                url: "/question/allUserPostedQuestions/dummy22