backend/artillery/tests/VisitQuestionFlow.yml
config:
    target: "http://localhost:5001/api"
    phases:
        - duration: 60
          arrivalRate: 10
          name: Warm up
        - duration: 120
          arrivalRate: 2
          rampTo: 50
          name: Ramp up load
        - duration: 500
          arrivalRate: 50
          name: Sustained load
    defaults:
        headers:
            utorid: "dummy22"
    payload:
        - path: "../questions.txt"
          fields:
              - "qnsLink"
          loadAll: true
        - path: "../courses.txt"
          fields:
              - "courseId"
          loadAll: true
        - path: "../pages.txt"
          fields:
              - "page"
          loadAll: true

scenarios:
    - name: "Go to a question"
    
      flow:
          - get:
                url: "/account/getAccount/dummy22"
          - think: 1
          - get:
                url: "/topic/getTopics/{{ courseId }}"
          - get:
                url: "/question/latestQuestions/{{ courseId }}/{{ page }}"
          - think: 5
          - get:
                url: "/question/oneQuestion/{{ qnsLink }}"